Config/Documents/УниверсальныйРегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УниверсальныйРегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРедактировавший</Name>
					<Comment>Пользователь, внесший последние изменения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РедакцииОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПечатныйБланк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыМежотчетногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМежотчетногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехнологическиеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВалютыБаланса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебныеОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/УниверсальныйРегламентированныйОтчет/Forms/РасшифровкаПоказателей/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Информация = ПолучитьИзВременногоХранилища(Параметры.АдресДанныхОтображения);
	Если ТипЗнч(Информация) = Тип("ТабличныйДокумент") Тогда
		ТабличныйДокументРасшифровки.Вывести(Информация);
	Иначе
		ТабличныйДокументРасшифровки.Вывести(Информация.ТабличныйДокумент);
		
		Если ТипЗнч(Информация.ДанныеРасшифровки) = Тип("Строка") Тогда
			АдресДанныхРасшифровки = Информация.ДанныеРасшифровки;
		Иначе
			АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(Информация.ДанныеРасшифровки,УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументРасшифровкиПриАктивизацииОбласти(Элемент)
	
	ПолеСумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ТабличныйДокументРасшифровкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	РежимРасшифровки = РежимИспользованияРасшифровки(ЭтаФорма);
	
	Если РежимРасшифровки = "УниверсальныйОтчет" Тогда
		ОбработкаРасшифровкиУниверсальныйОтчет(Элемент, Расшифровка, СтандартнаяОбработка);
	ИначеЕсли РежимРасшифровки = "Автозаполнение" Тогда
		ОбработкаРасшифровкиАвтозаполнение(Элемент, Расшифровка, СтандартнаяОбработка)
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Функция РежимИспользованияРасшифровки(Знач ЭтаФорма)
 
	Если ПустаяСтрока(ЭтаФорма.Параметры.РежимОбработкиРасшифровки) Тогда
		Возврат "УниверсальныйОтчет";
	Иначе
		Возврат ЭтаФорма.Параметры.РежимОбработкиРасшифровки;
	КонецЕсли;

КонецФункции // РежимИспользованияРасшифровки()


&НаКлиенте
Процедура ОбработкаРасшифровкиАвтозаполнение(Знач Элемент, Знач Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.ОбластиЗаполнения") Тогда
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ОткрытьФорму("Справочник.ОбластиЗаполнения.Форма.ФормаЭлемента", ПараметрыФормы);
		Возврат;
		
	КонецЕсли;
	
	
	ПараметрыСтандартногоОтчета = ПодготовитьПараметрыСтандартногоОтчета(Расшифровка, АдресДанныхРасшифровки);
	Если ПараметрыСтандартногоОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ПараметрыСтандартногоОтчета) = Тип("Структура") Тогда
		ОткрытьФорму(ПараметрыСтандартногоОтчета.ИмяФормы, ПараметрыСтандартногоОтчета.ПараметрыФормы, ЭтаФорма);
		Возврат;
	КонецЕсли;	
	
	
	ДополнительныеПараметры = Новый Структура;                      	
	ДополнительныеПараметры.Вставить("Источник","ОбработкаРасшифровкиАвтозаполнение");
	ДополнительныеПараметры.Вставить("Расшифровка",Расшифровка);
	ДополнительныеПараметры.Вставить("АдресДанныхРасшифровки",АдресДанныхРасшифровки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПроизвольногоОповещения", ЭтаФорма, ДополнительныеПараметры);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения,ПараметрыСтандартногоОтчета, Элемент);
	
КонецПроцедуры // ОбработкаРасшифровкиУниверсальныйОтчет()

&НаСервереБезКонтекста
Функция ПодготовитьПараметрыСтандартногоОтчета(Знач ИдентификаторРасшифровки, Знач АдресДанныхРасшифровки, Знач НомерОпцииРасшифровки = -1)

	ПараметрыСтандартногоОтчета = Новый Структура("ИмяФормы,ПараметрыФормы","",Новый Структура);
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	Расшифровка = ДанныеРасшифровки[ИдентификаторРасшифровки];
	Если Расшифровка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Расшифровка.Количество() = 1 Тогда
		ОпцииРасшифровки = Расшифровка[0].Значение;
	Иначе
		
		Если НомерОпцииРасшифровки = -1 Тогда
			Возврат ПодготовитьСписокВыбораОпцииРасшифровки(Расшифровка);
		Иначе
			ОпцииРасшифровки = Расшифровка[НомерОпцииРасшифровки].Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСтандартногоОтчета.ИмяФормы = "Отчет."+ОпцииРасшифровки.Отчет+".Форма";
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	Для Каждого Реквизит Из ОпцииРасшифровки.РеквизитыФормы Цикл
		Если ТипЗнч(Реквизит.Значение) = Тип("Граница") Тогда
			ДатаПоПараметру = ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(Реквизит.Значение);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(Реквизит.Ключ, ДатаПоПараметру);
			Если ТипЗнч(Реквизит.Значение.Значение) = Тип("МоментВремениСУточнениемПериода")
				И Реквизит.Ключ = "КонецПериода" Тогда
				МоментСУточнением = Реквизит.Значение.Значение; 
				ТипПериода = Перечисления.ВидыМежотчетногоПериода.ПустаяСсылка();
				Если МоментСУточнением.УточнениеПериода = 1
					И Реквизит.Значение.ВидГраницы = ВидГраницы.Включая Тогда
					ТипПериода = Перечисления.ВидыМежотчетногоПериода.ЗаключениеСчетов;
				ИначеЕсли МоментСУточнением.УточнениеПериода = 4 Тогда
					Если Реквизит.Значение.ВидГраницы = ВидГраницы.Включая Тогда
						ТипПериода = Перечисления.ВидыМежотчетногоПериода.ТехнологическиеОперации;
					Иначе
						ТипПериода = Перечисления.ВидыМежотчетногоПериода.ЗаключениеСчетов;
					КонецЕсли;
				ИначеЕсли МоментСУточнением.УточнениеПериода = 7 Тогда
					Если Реквизит.Значение.ВидГраницы = ВидГраницы.Включая Тогда 
						ТипПериода = Перечисления.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса;
					Иначе
						ТипПериода = Перечисления.ВидыМежотчетногоПериода.ТехнологическиеОперации;	
					КонецЕсли;
				КонецЕсли;
				ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ТипПериода", ТипПериода);
			КонецЕсли;
		Иначе
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(Реквизит.Ключ, Реквизит.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ОпцииРасшифровки.Показатели.Количество() = 0 и Не ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ПоказательБУ") Тогда
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательБУ", Истина);
	Иначе
		Для Каждого КлючПоказателя Из ОпцииРасшифровки.Показатели Цикл
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(КлючПоказателя.Ключ, КлючПоказателя.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ОтборКомпоновкиДанных = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ОтборКомпоновкиДанных.ИдентификаторПользовательскойНастройки = "Отбор";
	ПеренестиОтборВКомпоновщикНастроек(ОтборКомпоновкиДанных,ОпцииРасшифровки.Отбор);
	
	ПараметрыСтандартногоОтчета.ПараметрыФормы.Вставить("РежимРасшифровки"         , Истина);
	ПараметрыСтандартногоОтчета.ПараметрыФормы.Вставить("ВидРасшифровки"           , 2);
	ПараметрыСтандартногоОтчета.ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	Возврат ПараметрыСтандартногоОтчета;
	
КонецФункции // ПодготовитьПараметрыСтандартногоОтчета()

&НаСервереБезКонтекста
Процедура ПеренестиОтборВКомпоновщикНастроек(Знач ОбластьОтбораСКД, Знач Отбор)

	Для Каждого СтрОтбор Из Отбор.Строки Цикл
		
		Если СтрОтбор.ЭтоГруппа Тогда
			
			ГруппаОтбора = ОбластьОтбораСКД.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = СтрОтбор.ТипГруппы;
			
			ПеренестиОтборВКомпоновщикНастроек(ГруппаОтбора,СтрОтбор);
			
		Иначе
			
			ЭлементОтбора = ОбластьОтбораСКД.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтрОтбор.ЛевоеЗначение);
			ЭлементОтбора.ВидСравнения   = СтрОтбор.ВидСравнения;
			ЭлементОтбора.ПравоеЗначение = СтрОтбор.ПравоеЗначение;
			ЭлементОтбора.Использование  = Истина;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьСписокВыбораОпцииРасшифровки(Знач СписокВозможныхРасшифровок)

	СписокВыбора = Новый СписокЗначений;
	Для Сч = 0 По СписокВозможныхРасшифровок.Количество()-1 Цикл
		ЭлементСписка = СписокВозможныхРасшифровок[Сч];
		СписокВыбора.Добавить(Сч, ЭлементСписка.Представление);
	КонецЦикла;

	Возврат СписокВыбора;
	
КонецФункции // ПодготовитьСписокВыбораОпцииРасшифровки()


&НаКлиенте
Процедура ОбработкаРасшифровкиУниверсальныйОтчет(Знач Элемент, Знач Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Число") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимРасшифровки"	,Истина);
		ПараметрыФормы.Вставить("ДанныеРасшифровки" ,Новый Структура("Идентификатор,АдресХранилища",Расшифровка,АдресДанныхРасшифровки));
		
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры // ОбработкаРасшифровкиУниверсальныйОтчет()

&НаКлиенте
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента()
	
	Сумма = 0;
	Для Каждого Область Из Элементы.ТабличныйДокументРасшифровки.ПолучитьВыделенныеОбласти() Цикл
		Если ТипЗнч(Область) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;	
		
		Для ИндексСтрока = Область.Верх По Область.Низ Цикл
			Для ИндексКолонка = Область.Лево По Область.Право Цикл
				Попытка
					Ячейка = ТабличныйДокументРасшифровки.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0"));
					Если Ячейка.Видимость = Истина Тогда
						Сумма = Сумма + Число(СтрЗаменить(Ячейка.Текст, " ", ""));
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПроизвольногоОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Источник = "ОбработкаРасшифровкиАвтозаполнение" Тогда 
		
		Если Результат = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		
		ПараметрыСтандартногоОтчета = ПодготовитьПараметрыСтандартногоОтчета(ДополнительныеПараметры.Расшифровка, ДополнительныеПараметры.АдресДанныхРасшифровки, Результат.Значение);
		ОткрытьФорму(ПараметрыСтандартногоОтчета.ИмяФормы, ПараметрыСтандартногоОтчета.ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;	
	
КонецПроцедуры
